1 开发相关
  1.1 非功能需求
    1.1.1 性能
    1.1.2 安全
    1.1.3 负载
    1.1.4 容错能力
        1.1.4.1 隔离性
        1.1.4.2 消息队列
  1.2 技术选型
    1.2.1 前端
    1.2.2 移动端
        1.2.2.1 Native
        1.2.2.2 Hybird
    1.2.3 后端
    1.2.4 数据库
        1.2.4.1 关系型数据库
        1.2.4.2 NOSQL
                1.2.4.2.1 Mongodb
                1.2.4.2.2 couchdb
  1.3 基础设施
    1.3.1 虚拟化
        1.3.1.1 Vagrant
        1.3.1.2 容器技术
    1.3.2 CI环境
        1.3.2.1 public accessable service
                1.3.2.1.1 snapci
                1.3.2.1.2 travis
        1.3.2.2 自己搭建环境
  1.4 可演化的软件架构
    1.4.1 初始版本
    1.4.2 易于演进的架构
  1.5 工程实践
    1.5.1 code review
        1.5.1.1 code diff服务器
        1.5.1.2 svn diff
    1.5.2 自动化测试
        1.5.2.1 单元测试
        1.5.2.2 集成测试
        1.5.2.3 moco
        1.5.2.4 负载测试
    1.5.3 持续交付
        1.5.3.1 CI服务器
        1.5.3.2 部署脚本